src/cf/Enums/ПозицииНаРабочемСтоле.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПозицииНаРабочемСтоле</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БлокНавигации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Виджет1_1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Виджет1_2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Виджет1_3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Виджет2_1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Виджет2_2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Виджет2_3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Виджет3_1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Виджет3_2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Виджет3_3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Виджет4_1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Виджет4_2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Виджет4_3</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ПозицииНаРабочемСтоле/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СвойствоСхемы(Позиция) Экспорт
	
	Если Позиция = Виджет1_1 Тогда
		СвойствоСхемы = "Виджет1_1";
	ИначеЕсли Позиция = Виджет1_2 Тогда
		СвойствоСхемы =  "Виджет1_2";
	ИначеЕсли Позиция = Виджет1_3 Тогда
		СвойствоСхемы =  "Виджет1_3";
	ИначеЕсли Позиция = Виджет2_1 Тогда
		СвойствоСхемы =  "Виджет2_1";
	ИначеЕсли Позиция = Виджет2_2 Тогда
		СвойствоСхемы =  "Виджет2_2";
	ИначеЕсли Позиция = Виджет2_3 Тогда
		СвойствоСхемы =  "Виджет2_3";
	ИначеЕсли Позиция = Виджет3_1 Тогда
		СвойствоСхемы =  "Виджет3_1";
	ИначеЕсли Позиция = Виджет3_2 Тогда
		СвойствоСхемы =  "Виджет3_2";
	ИначеЕсли Позиция = Виджет3_3 Тогда
		СвойствоСхемы =  "Виджет3_3";
	ИначеЕсли Позиция = Виджет4_1 Тогда
		СвойствоСхемы =  "Виджет4_1";
	ИначеЕсли Позиция = Виджет4_2 Тогда
		СвойствоСхемы =  "Виджет4_2";
	ИначеЕсли Позиция = Виджет4_3 Тогда
		СвойствоСхемы =  "Виджет4_3";
	ИначеЕсли Позиция = БлокНавигации Тогда
		СвойствоСхемы =  "БлокНавигации";
	Иначе
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Неизвестно свойство схемы позиции %1.'"),
			Позиция);
	КонецЕсли;
	
	Возврат СвойствоСхемы;
	
КонецФункции

#КонецОбласти

#КонецЕсли
